horoscope_rails/app/views/users/index.html.erb

<main>
    <% @users = User.all %>
---
SELECT "users".* FROM "users"