horoscope_rails/app/views/posts/show.html.erb


    <% if @post.comments.any? %>
---
SELECT 1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT $2  [["post_id", 2], ["LIMIT", 1]]