horoscope_rails/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 298486374]]
---
      <%= link_to "Add a comment", new_post_comment_path(@post), class: "rounded-lg py-3 ml-2 px-5 bg-gray-100 inline-block font-medium" %>
      <% @post.comments.each do |comment| %>