horoscope_rails/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "123"], ["user_id", 19093718], ["post_id", 980190966], ["created_at", "2024-01-20 11:23:41.111020"], ["updated_at", "2024-01-20 11:23:41.111020"]]
---
  def create
    @comment = @post.comments.build(comment_params.merge(user: current_user))

    if @comment.save

UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "2"], ["updated_at", "2024-01-20 11:07:31.747423"], ["id", 3]]
---
  def update
    if @comment.update(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 980190962], ["id", 3], ["LIMIT", 1]]
---
  def set_comment
    @comment = @post.comments.find(params[:id])