horoscope_rails/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["body", "test"], ["created_at", "2024-01-12 12:56:28.704452"], ["updated_at", "2024-01-12 12:56:28.704452"]]