horoscope_rails/app/controllers/users_controller.rb

	def update_role
		@user = User.find(params[:id])

		if current_user.admin? && @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19093718], ["LIMIT", 1]]
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", 1], ["updated_at", "2024-01-20 11:34:58.727392"], ["id", 19093718]]